/*
编写程序，使用一维数组，模拟数据结构
要求
1 这个栈可以存储任何引用类型的 数据
2 在栈中提供push方法模拟压栈。（栈满了，要有提示信息
3 在栈中提供pop方法模拟弹栈（栈空了，也要有提示信息
4 编写测试程序，new栈对象，调用push pop方法来模拟压栈弹栈的动作

public class mystack{

Object[] elements;

栈帧（永远指向栈顶的元素
每加一个元素栈帧+1
每-一个元素栈帧-1
int index

构造方法
构造方法给一维数组一个初始化容量

push方法（push方法压栈
压栈不要栈多一个元素
但是压栈已满，压栈失败
这个方法的参数以及方法值类型自己定义

pop方法（pop方法弹栈
弹栈表示少一个元素
但是如果以空，弹栈失败
这个方法的参数以及方法值类型自己定义

main
* */


/*java工程师，第一个小型项目
为某个酒店编写程序，酒店管理系统，模拟订房，退饭，打印所有房间状态等功能
1 该系统的用户是，酒店前台
2 酒店中使用一个二维数组来模拟
3 酒店中的每一个房间应该算是一个java对象：room
4 每个房间room都有：房间编号，房间类型属性，房间是否空闲
5 系统应该对外提供的功能
可以预定方法：用户输入房间号，订房
可以退房：用户输入房间编号，退房
可以查看所有房间的状态：用户输入某个指令应该可以查看所有房间状态


* */


public class zouye {
}
